#### Terraform Plan 📖 `success`

<details><summary>詳細なログを表示</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/environments/dev relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/web-daw-backend/web-daw-backend/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/web-daw-backend/web-daw-backend

To view this run in a browser, visit:
https://app.terraform.io/app/isb-ikenoya-study/web-daw-backend/runs/run-as7o6xRc9X6Rcnz2

Waiting for the plan to start...

Terraform v1.14.6
on linux_amd64
Initializing plugins and modules...
module.route53.data.aws_route53_zone.parent: Refreshing...
module.cloud_front.data.aws_route53_zone.this: Refreshing...
module.cloud_front.aws_cloudfront_origin_access_control.s3: Refreshing state... [id=E3INN5EP3F96LR]
module.codegenie-api.aws_iam_role.lambda_exec: Refreshing state... [id=web-daw-dev-lambda-role]
module.codegenie-api.aws_lambda_layer_version.demo_layer: Refreshing state... [id=arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:4]
module.codegenie-api.aws_apigatewayv2_api.this: Refreshing state... [id=8usf1u2f1g]
module.route53.aws_route53_zone.public_zone: Refreshing state... [id=Z07777823QWN63F6XYQ35]
module.codegenie-api.aws_s3_bucket.lambda: Refreshing state... [id=web-daw-dev-api-bucket]
module.s3_front_end.aws_s3_bucket.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.codegenie-api.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=web-daw-dev-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.cloud_front.data.aws_route53_zone.this: Refresh complete after 0s [id=Z07777823QWN63F6XYQ35]
module.route53.data.aws_route53_zone.parent: Refresh complete after 0s [id=Z05552098SOY2YNHN5H]
module.route53.aws_route53_record.parent_ns_delegation: Refreshing state... [id=Z05552098SOY2YNHN5H_various-ikenoya.isb-bs.com_NS]
module.acm.aws_acm_certificate.virginia_cert: Refreshing state... [id=arn:aws:acm:us-east-1:374474405705:certificate/8809591b-ccd9-493e-99f6-7a0c6d0bfe52]
module.acm.aws_route53_record.route53_acm_dns_resolve["various-ikenoya.isb-bs.com"]: Refreshing state... [id=Z07777823QWN63F6XYQ35__42d33b35779d7766862cd281f522ffc4.various-ikenoya.isb-bs.com_CNAME]
module.codegenie-api.aws_apigatewayv2_stage.lambda_stage: Refreshing state... [id=main-stage]
module.acm.aws_acm_certificate_validation.cert_valid: Refreshing state... [id=2026-03-04 08:17:13.091 +0000 UTC]
module.s3_front_end.aws_s3_bucket_public_access_block.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.cloud_front.aws_cloudfront_distribution.this: Refreshing state... [id=E5443JXSUPKLD]
module.codegenie-api.aws_s3_object.dummy: Refreshing state... [id=web-daw-dev-api-bucket/initial/lambda_fix_v4.zip]
module.cloud_front.data.aws_iam_policy_document.front: Refreshing...
module.cloud_front.aws_route53_record.record_a: Refreshing state... [id=Z07777823QWN63F6XYQ35_various-ikenoya.isb-bs.com_A]
module.cloud_front.aws_route53_record.record_aaaa: Refreshing state... [id=Z07777823QWN63F6XYQ35_various-ikenoya.isb-bs.com_AAAA]
module.cloud_front.data.aws_iam_policy_document.front: Refresh complete after 0s [id=4167549089]
module.cloud_front.aws_s3_bucket_policy.front: Refreshing state... [id=web-daw-dev-front-bucket]
module.codegenie-api.aws_lambda_function.api: Refreshing state... [id=web-daw-dev-api]
module.codegenie-api.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.codegenie-api.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=vct83m4]
module.codegenie-api.aws_apigatewayv2_route.api_route: Refreshing state... [id=qirrnga]
module.codegenie-api.aws_lambda_layer_version.demo_layer: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.codegenie-api.aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "web-daw-dev-api"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:4",
        ] -> (known after apply)
        tags                           = {
            "created_by" = "yuta_ikenoya"
        }
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.codegenie-api.aws_lambda_layer_version.demo_layer must be replaced
-/+ resource "aws_lambda_layer_version" "demo_layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:4" -> (known after apply)
      ~ code_sha256                 = "Z3oYioYMPldirNCey/Swo7qOalRQe49ILddwqDJbuXc=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2026-03-11T14:06:31.297+0000" -> (known after apply)
      ~ filename                    = "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-57rJkcUJ7tpgwHHQ/config/infra/modules/lambda-node-api/layer.zip" -> "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-as7o6xRc9X6Rcnz2/config/infra/modules/lambda-node-api/layer.zip" # forces replacement
      ~ id                          = "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:374474405705:layer:layer-demo-ikenoya" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Z3oYioYMPldirNCey/Swo7qOalRQe49ILddwqDJbuXc=" -> "5bhYQamkx5Nx8KnBzfvV0jYFXqbbrYjmdhVw8PweYIA=" # forces replacement
      ~ source_code_size            = 14668496 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @isb-ikenoya, Action: `pull_request`*